Tekla Open API Reference for Tekla Structures 2025
GraphicPolyLine Class
[Missing <summary> documentation for "T:Tekla.Structures.Model.UI.GraphicPolyLine"]
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.UI.GraphicPolyLine
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class GraphicPolyLine
<SerializableAttribute>
Public NotInheritable Class GraphicPolyLine
The GraphicPolyLine type exposes the following members.
Constructors
Name | Description
GraphicPolyLine()
 Create a black line with width 1 and solid line type.
GraphicPolyLine(Color, Int32, GraphicPolyLine.LineType)
 Create a graphic polyline object with 0 points.
GraphicPolyLine(PolyLine, Color, Int32, GraphicPolyLine.LineType)
 Create a graphic polyline object.
Top
Properties
Name | Description
Color
 The line color.
PolyLine
 The path of the line.
Type
 The appearance of the line. For instance solid, dashed or dotted.
Width
 The line width in pixels. NOTE: Currently the valid width values are 1, 2 and 4
Top
See Also
Reference
Tekla.Structures.Model.UI Namespace